wef/01-enumerate-response.xml

<!--
Server(127.0.0.1:5986)->Client(127.0.0.1:61232):
HTTP/1.1 200
Content-Type: application/soap+xml;charset=UTF-16
Server: Microsoft-HTTPAPI/2.0
Date: Sat, 08 Dec 2018 15:43:09 GMT
Content-Length: 10034
-->
<s:Envelope
    xml:lang="en-US"
    xmlns:s="http://www.w3.org/2003/05/soap-envelope"
    xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing"
    xmlns:n="http://schemas.xmlsoap.org/ws/2004/09/enumeration"
    xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd"
    xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd">
  <s:Header>
    <a:Action>http://schemas.xmlsoap.org/ws/2004/09/enumeration/EnumerateResponse</a:Action>
    <a:MessageID>uuid:E9551077-353E-4E0B-8CA2-850776E94B09</a:MessageID>
    <a:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:To>
    <p:OperationID s:mustUnderstand="false">uuid:956ED6AD-72EC-442C-8F05-F7BD23733DC3</p:OperationID>
    <p:SequenceId>1</p:SequenceId>
    <a:RelatesTo>uuid:D8B2F903-E1DF-478E-9BDF-EE5329A16529</a:RelatesTo>
  </s:Header>
  <s:Body>
    <n:EnumerateResponse>
      <n:EnumerationContext>
      </n:EnumerationContext>
      <w:Items>
        <m:Subscription xmlns:m="http://schemas.microsoft.com/wbem/wsman/1/subscription">
          <m:Version>uuid:794B572A-0F96-46A6-8EFF-0F81EE927A05</m:Version>
          <s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:e="http://schemas.xmlsoap.org/ws/2004/08/eventing" xmlns:n="http://schemas.xmlsoap.org/ws/2004/09/enumeration" xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd">
            <s:Header>
              <a:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:To>
              <w:ResourceURI s:mustUnderstand="true">http://schemas.microsoft.com/wbem/wsman/1/windows/EventLog</w:ResourceURI>
              <a:ReplyTo>
                <a:Address s:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:Address>
              </a:ReplyTo>
              <a:Action s:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/eventing/Subscribe</a:Action>
              <w:MaxEnvelopeSize s:mustUnderstand="true">512000</w:MaxEnvelopeSize>
              <a:MessageID>uuid:290B5848-44D8-4926-B965-947E25CBD253</a:MessageID>
              <w:Locale xml:lang="en-US" s:mustUnderstand="false" />
              <p:DataLocale xml:lang="en-US" s:mustUnderstand="false" />
              <p:OperationID s:mustUnderstand="false">uuid:3D30720D-2931-4B99-A15E-C828CE3D9E8A</p:OperationID>
              <p:SequenceId s:mustUnderstand="false">1</p:SequenceId>
              <w:OptionSet xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
                <w:Option Name="SubscriptionName">Test Subscription</w:Option>
                <w:Option Name="Compression">SLDC</w:Option>
                <w:Option Name="CDATA" xsi:nil="true"/>
                <w:Option Name="ContentFormat">RenderedText</w:Option>
                <w:Option Name="IgnoreChannelError" xsi:nil="true"/>
              </w:OptionSet>
            </s:Header>
            <s:Body>
              <e:Subscribe>
                <e:EndTo>
                  <a:Address>HTTPS://10.0.2.2:15986/wsman/subscriptions/36BEB691-AFE1-458F-A6B4-8B60037F9BEE/1</a:Address>
                  <a:ReferenceProperties>
                    <e:Identifier>794B572A-0F96-46A6-8EFF-0F81EE927A05</e:Identifier>
                  </a:ReferenceProperties>
                </e:EndTo>
                <e:Delivery Mode="http://schemas.dmtf.org/wbem/wsman/1/wsman/Events">
                  <w:Heartbeats>PT900.000S</w:Heartbeats>
                  <e:NotifyTo>
                    <a:Address>HTTPS://10.0.2.2:15986/wsman/subscriptions/36BEB691-AFE1-458F-A6B4-8B60037F9BEE/1</a:Address>
                    <a:ReferenceProperties>
                      <e:Identifier>794B572A-0F96-46A6-8EFF-0F81EE927A05</e:Identifier>
                    </a:ReferenceProperties>
                    <c:Policy xmlns:c="http://schemas.xmlsoap.org/ws/2002/12/policy" xmlns:auth="http://schemas.microsoft.com/wbem/wsman/1/authentication">
                      <c:ExactlyOne>
                        <c:All>
                          <auth:Authentication Profile="http://schemas.dmtf.org/wbem/wsman/1/wsman/secprofile/https/mutual">
                            <auth:ClientCertificate>
                              <auth:Thumbprint Role="issuer">1210E56386970E9427998060BB9DC37BD8EE098A</auth:Thumbprint>
                            </auth:ClientCertificate>
                          </auth:Authentication>
                        </c:All>
                      </c:ExactlyOne>
                    </c:Policy>
                  </e:NotifyTo>
                  <w:ConnectionRetry Total="5">PT60.0S</w:ConnectionRetry>
                  <w:MaxTime>PT900.000S</w:MaxTime>
                  <w:MaxEnvelopeSize Policy="Notify">512000</w:MaxEnvelopeSize>
                  <w:Locale xml:lang="en-US" s:mustUnderstand="false" />
                  <p:DataLocale xml:lang="en-US" s:mustUnderstand="false" />
                  <w:ContentEncoding>UTF-16</w:ContentEncoding>
                </e:Delivery>
                <w:Filter Dialect="http://schemas.microsoft.com/win/2004/08/events/eventquery">
                  <QueryList>
                    <Query Id="0">
                      <Select Path="Application">*[System[(Level=1  or Level=2 or Level=3 or Level=4 or Level=0 or Level=5) and TimeCreated[timediff(@SystemTime) &lt;= 86400000]]]</Select>
                      <Select Path="Security">*[System[(Level=1  or Level=2 or Level=3 or Level=4 or Level=0 or Level=5) and TimeCreated[timediff(@SystemTime) &lt;= 86400000]]]</Select>
                      <Select Path="Setup">*[System[(Level=1  or Level=2 or Level=3 or Level=4 or Level=0 or Level=5) and TimeCreated[timediff(@SystemTime) &lt;= 86400000]]]</Select>
                      <Select Path="System">*[System[(Level=1  or Level=2 or Level=3 or Level=4 or Level=0 or Level=5) and TimeCreated[timediff(@SystemTime) &lt;= 86400000]]]</Select>
                      <Select Path="ForwardedEvents">*[System[(Level=1  or Level=2 or Level=3 or Level=4 or Level=0 or Level=5) and TimeCreated[timediff(@SystemTime) &lt;= 86400000]]]</Select>
                    </Query>
                  </QueryList>
                </w:Filter>
                <w:SendBookmarks/>
              </e:Subscribe>
            </s:Body>
          </s:Envelope>
        </m:Subscription>
      </w:Items>
      <w:EndOfSequence/>
    </n:EnumerateResponse>
  </s:Body>
</s:Envelope>
